addi $2,$zero,0x00007F00 #Timer地址
addi $3,$zero,0x00007D00 #keyboard地址
addi $4,$zero,0x00007E00 #数码管地址
addi $17,$zero,0x00001001 #SR寄存器输入值
addi $9,$zero,0x00000009 #ctrl寄存器输入值
addi $14,$zero,0x00000a00 #count寄存器输入值
mtc0 $17,$12 #给SR赋值
sw $9,4($2)  #将$9的值赋予 ctrl寄存器
sw $14,8($2)  #将$14的值赋予 count寄存器
exit: j exit

lw $10,0($3)#载入 keyboard 的值到$10
lw $11,0($4)#载入 数码管 的值到$10
beq $10,$11,then#如果键盘中的值和数码管中初始值不同则进入赋值阶段，修改数码管中的初始值
sw $10,0($4)#如果不相等，将数码管的初始值更新为新的输入值如果相等，则给其中的计数寄存器加1
sw $10,4($4)#如果不相等，将数码管计数的起步值改成初始值
beq $0,$0,jump
then:#如果相等，则给其中的计数寄存器加一
lw $23,4($4)#digitial 计数器，取出并加一
addi $23,$23,1
sw $23,4($4)#存入digitial计数器
jump:sw $14,8($2)
